



Internet Engineering Task Force                                 E. Kline
Internet-Draft                                           Google Japan KK
Updates: 4861,6275 (if approved)                          M. Abrahamsson
Intended status: Experimental                           T-Systems Nordic
Expires: September 28, 2017                               March 27, 2017


   IPv6 Router Advertisement Prefix Information Option eXclusive Flag
               draft-pioxfolks-6man-pio-exclusive-bit-02

Abstract

   This document defines a new control bit in the IPv6 RA PIO flags
   octet that indicates that the node receiving this RA is the exclusive
   receiver of all traffic destined to any address within that prefix.

   Termed the eXclusive flag (or "X flag"), nodes that recognize this
   can perform some optimizations to save time and traffic (e.g. disable
   ND and DAD for addresses within this prefix) and more immediately
   pursue the benefits of being provided multiple addresses (vis.
   [RFC7934] section 3).  Additionally, network infrastructure nodes
   (routers, switches) can benefit by minimizing the number of {link
   layer, IP} address pairs required to offer network connectivity (vis.
   [RFC7934] section 9.3).

   Use of the X flag is backward compatible with existing IPv6 standards
   compliant implementations.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at http://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on September 28, 2017.

Copyright Notice





Kline & Abrahamsson    Expires September 28, 2017               [Page 1]

Internet-Draft         IPv6 RA PIO eXclusive Flag             March 2017


   Copyright (c) 2017 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3
   2.  Motivation  . . . . . . . . . . . . . . . . . . . . . . . . .   3
     2.1.  Efficiency improvements . . . . . . . . . . . . . . . . .   4
     2.2.  New architectural possibilities . . . . . . . . . . . . .   4
   3.  Applicability statement . . . . . . . . . . . . . . . . . . .   5
   4.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . .   6
     4.1.  Requirements Language . . . . . . . . . . . . . . . . . .   6
     4.2.  Abbreviations . . . . . . . . . . . . . . . . . . . . . .   6
       4.2.1.  PIO-X . . . . . . . . . . . . . . . . . . . . . . . .   6
       4.2.2.  PIO-X RA  . . . . . . . . . . . . . . . . . . . . . .   6
       4.2.3.  Host  . . . . . . . . . . . . . . . . . . . . . . . .   6
   5.  Updated Prefix Information Option . . . . . . . . . . . . . .   6
     5.1.  Updated format description  . . . . . . . . . . . . . . .   6
     5.2.  Receiver processing . . . . . . . . . . . . . . . . . . .   7
       5.2.1.  PIO R flag  . . . . . . . . . . . . . . . . . . . . .   7
       5.2.2.  (Re)Interpretation of other flags . . . . . . . . . .   7
         5.2.2.1.  PIO L flag  . . . . . . . . . . . . . . . . . . .   8
         5.2.2.2.  PIO A flag  . . . . . . . . . . . . . . . . . . .   8
     5.3.  Sender requirements . . . . . . . . . . . . . . . . . . .   8
     5.4.  Comparison with DHCPv6 PD . . . . . . . . . . . . . . . .   9
   6.  Host behavior . . . . . . . . . . . . . . . . . . . . . . . .   9
     6.1.  PIO-X processing  . . . . . . . . . . . . . . . . . . . .   9
     6.2.  Neighbor Discovery implications . . . . . . . . . . . . .   9
       6.2.1.  Duplicate Address Detection (DAD) . . . . . . . . . .   9
       6.2.2.  Router Solicitations (RSes) . . . . . . . . . . . . .  10
     6.3.  Link-local address behavior . . . . . . . . . . . . . . .  10
     6.4.  Source address selection  . . . . . . . . . . . . . . . .  10
     6.5.  Next hop router selection . . . . . . . . . . . . . . . .  11
     6.6.  Implications for Detecting Network Attachment . . . . . .  11
     6.7.  Additional guidance . . . . . . . . . . . . . . . . . . .  11
   7.  Router behavior . . . . . . . . . . . . . . . . . . . . . . .  11
     7.1.  PIO-X RA destination address  . . . . . . . . . . . . . .  11
     7.2.  Detecting hosts to send PIO-X RAs to  . . . . . . . . . .  12



Kline & Abrahamsson    Expires September 28, 2017               [Page 2]

Internet-Draft         IPv6 RA PIO eXclusive Flag             March 2017


     7.3.  Binding table requirements  . . . . . . . . . . . . . . .  12
     7.4.  Preparations before sending a PIO-X RA  . . . . . . . . .  13
     7.5.  Implementation considerations . . . . . . . . . . . . . .  13
   8.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .  13
   9.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  13
   10. Security Considerations . . . . . . . . . . . . . . . . . . .  13
   11. References  . . . . . . . . . . . . . . . . . . . . . . . . .  14
     11.1.  Normative References . . . . . . . . . . . . . . . . . .  14
     11.2.  Informative References . . . . . . . . . . . . . . . . .  14
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  15

1.  Introduction

   This document defines a new control flag in the Internet Protocol
   version 6 (IPv6) Router Advertisement (RA) Prefix Information Option
   (PIO) flags octet that indicates that the node receiving this RA is
   the exclusive receiver of all traffic destined to any address with
   that prefix.  Subject to the lifetime constraints within the PIO, the
   receiving node effectively has exclusive use of the prefix, and will
   be the next hop destination for the sending router, and possibly
   other routers, for all traffic destined toward the prefix.

   Termed the eXclusive flag (or "X flag"), nodes that recognize this
   can perform some optimizations to save time and traffic (e.g. disable
   Neighbor Discovery (ND) and Duplicate Address Detection (DAD) for
   addresses within this prefix) and more immediately pursue the
   benefits of being provided multiple addresses (vis.  [RFC7934]
   section 3).

   Additionally, network infrastructure nodes (routers, switches) can
   benefit by minimizing the number of {link layer, IP} address pairs
   required to offer network connectivity (vis.  [RFC7934] section 9.3).
   A router, for example, need not create any {link layer, IP} address
   pair entries for IP address within a proffered exclusive-use prefix--
   it can reliably forward all traffic to the network node to which it
   advertised the prefix.  This solves one potential link layer state
   exhaustion problem, i.e excessive number of {link layer, IP address
   pairs}, using IP layer forwarding.

   Use of the X flag is backward compatible with existing IPv6 standards
   compliant implementations.  [RFC4861]-compliant nodes that do not
   understand the X flag are not negatively impacted.  They must ignore
   it, and can process the PIO under existing standards, making use of
   the information exactly as if the X flag were not set.

2.  Motivation





Kline & Abrahamsson    Expires September 28, 2017               [Page 3]

Internet-Draft         IPv6 RA PIO eXclusive Flag             March 2017


   This work is motivated by the pursuit of two categories of benefits:
   modest host and network side improvements in efficiency, and support
   for new deployment architectures and address space use models.

2.1.  Efficiency improvements

   If a host knows it has exclusive use of a prefix it can perform some
   optimizations to save time and traffic.  It can avoid ND on the
   receiving interface for addresses within these prefixes.  Network
   interfaces can even drop Neighbor Solicitations for these addresses
   on the receiving interface to save power by not waking up more power-
   hungry CPUs.

   Additionally, a host can save time by not performing DAD for
   addresses within an exclusive-use prefix on the receiving interface.
   A host that wanted, for example, to use 2**64 unique IPv6 source
   addresses for DNS queries in order to improve resilience against
   forged answers (as recommended in section 9.2 of [1]), could do so
   without delaying each query from a newly formed address.  A node
   could in theory implement the same strategy using Optimistic
   Duplicate Address Detection [2], but it could be very unfriendly to
   the network infrastructure (in terms of {link-layer, IP address} pair
   state) to do so without this kind of explicit signal.

   A host that recognizes the X flag might perform other traffic-saving
   optimizations, like not attempt Multicast DNS in some cases, or avoid
   trying to register addresses with sleep proxies.  Being the only host
   on this link these may be of little benefit.

2.2.  New architectural possibilities

   There are several initiatives that propose network side practices
   that provide customer isolation, enhanced operational scalability,
   power efficiency, security and other benefits in IPv6 network
   deployments.  Some of these involve isolating a host (or RA accepting
   client node) so that the host is the only node to receive a specific
   prefix, including

   o  DHCPv6 Prefix Delegation to hosts ([3]), and

   o  advertising a unique prefix per host via unique RAs.  ([4]).

   Some architectures further isolate the host layers below IPv6, for
   improved client node security.

   Regardless of the specific level of isolation, the host can best make
   choices about its use of a prefix exclusively forwarded to itself if
   the host can be informed of the exclusivity.  (In the case of a



Kline & Abrahamsson    Expires September 28, 2017               [Page 4]

Internet-Draft         IPv6 RA PIO eXclusive Flag             March 2017


   DHCPv6 Prefix Delegation the prefix can be assumed to be of exclusive
   use by the requesting node, in accordance with the model in
   [RFC3633].)  An implementation can, for example, safely "bind to an
   IPv6 subnet" in the style of [5], or start 64sharing [6] (given a
   prefix of sufficient size).

   This memo documents an additional flag in the IPv6 RA PIO that makes
   this information explicit to receiving node.

3.  Applicability statement

   Use of the X flag in PIOs is only applicable to networks where the
   architecture (i.e. serving infrastructure like routers, link-layer
   equipment, et cetera) can collectively guarantee the following
   criteria are met:

   1.  an RA containing a PIO with the X flag set MUST be delivered to
       one and only target node (host) such that no two nodes can
       reasonably expect exclusive access to the same prefix at the same
       time

   2.  any router advertising an RA containing a PIO with the X flag set
       SHOULD be notified quickly when a node leaves the network

   The first criterion ensures that the same exclusive use prefix is not
   advertised to more than one host at a time (and hence no longer
   "exclusive").  This implies that an allocated exclusive-use prefix
   must be tracked by the issuing router for at least the minimum of (a)
   the lifetime of the recipient node's continuous attachment to the
   network and (b) the lifetime of the prefix itself in the PIO, if not
   longer.

   The second criterion aims to help the prefix allocation
   infrastructure reclaim unused prefixes quickly while also helping
   routers drop (possibly with appropriate ICMPv6 errors) traffic that
   can no longer be delivered.

   It is expected that in practice this primarily describes networks
   where the IPv6 infrastructure and the link-layer have a tight
   integration.  All point-to-point links meet these criteria (e.g.
   PPPoE and VPNs), as does the 3GPP architecture [RFC7066] and some
   IEEE 802.11 deployment architectures ([7]).









Kline & Abrahamsson    Expires September 28, 2017               [Page 5]

Internet-Draft         IPv6 RA PIO eXclusive Flag             March 2017


4.  Terminology

4.1.  Requirements Language

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119 [RFC2119].

4.2.  Abbreviations

   Throughout this document the following terminology is used purely for
   the sake of brevity.

4.2.1.  PIO-X

   The term "PIO-X" is used to refer to a Prefix Information Option
   (PIO) that has the X flag set.

4.2.2.  PIO-X RA

   The phrase "PIO-X RA" is used to refer to an IPv6 Router
   Advertisement (RA) that contains one or more PIO-X entries (the same
   RA may also contain one or more PIOs without the X flag set).

4.2.3.  Host

   The term "host" may be used interchangeably throughout this document
   to mean a network node receiving and processing an RA.  The receiving
   node may itself be a router, or may temporarily become one by routing
   all or a portion of an exclusive use prefix.

5.  Updated Prefix Information Option

   This document updates the Prefix Information Option specification in
   RFC 4861 [8] section 4.6.2 and RFC 6275 [9] section 7.2 with the
   definition of a flag from the former Reserved1 field as follows.

5.1.  Updated format description

      0                   1                   2                   3
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |     Type      |    Length     | Prefix Length |L|A|R|X| Rsrvd1|
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                         Valid Lifetime                        |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                       Preferred Lifetime                      |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+



Kline & Abrahamsson    Expires September 28, 2017               [Page 6]

Internet-Draft         IPv6 RA PIO eXclusive Flag             March 2017


     |                           Reserved2                           |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                                                               |
     +                                                               +
     |                                                               |
     +                            Prefix                             +
     |                                                               |
     +                                                               +
     |                                                               |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Fields:

   X          The eXclusive use indicator flag, defined by this document.
              When set, the receiving node can be assured that all traffic
              destined to any address within the specified Prefix will be
              forwarded to itself by, at a minimum, the router from which
              the encapsulating RA was received, but possibly other routers
              as well.

              When not set, the receiving node MUST NOT make any
              assumptions of exclusive use of the specified Prefix, i.e.
              processing is unchanged from previous standards behavior.

   Rsrvd1     Retains the same meaning as Reserved1 from [10] section
              4.6.2.

   All        Retain their same meaning from [11] section 4.6.2.
   other
   fields

5.2.  Receiver processing

   Nodes compliant with this specification perform the following
   additional processing of RAs and PIO-X options when a PIO-X option is
   present.

5.2.1.  PIO R flag

   If the R flag is set then the X flag MUST be ignored.  The R flag
   indicates that the PIO includes an address the router has selected
   for itself from the prefix.  Logically, the prefix cannot exclusively
   be used by the receiving node if the router has allocated any
   addresses for itself from the prefix.

5.2.2.  (Re)Interpretation of other flags




Kline & Abrahamsson    Expires September 28, 2017               [Page 7]

Internet-Draft         IPv6 RA PIO eXclusive Flag             March 2017


   Nodes compliant with this specification, i.e. those that understand
   the X-flag, MUST, when the X-flag is set, ignore the actual values of
   the L and A flags and instead interpret them as follows:

   o  interpret the L flag as if it were 0 (L=0)

   o  interpret the A flag as it it were 1 (A=1)

   The rationale for this is as follows.

5.2.2.1.  PIO L flag

   Because a PIO-X aware node will know that it has exclusive use of a
   prefix with non-zero valid lifetime, the prefix itself cannot be
   considered to be on-link with respect to the link on which the PIO-X
   RA was received.

   Note that a given address from within the prefix may be considered
   on-link according to the definition in [12] section 4, item 1, should
   the receiving node chose to configure that address on said link, but
   this is in no way synonymous with the entire prefix being considered
   on-link.

5.2.2.2.  PIO A flag

   Because a PIO-X aware node will know that it has exclusive use of a
   prefix with non-zero valid lifetime, autoconfiguration of addresses
   according to any desired scheme, e.g. [13], [14], et cetera, is
   implicit in the setting of the X flag.

   Accordingly, the A flag can be interpreted as having been set, should
   the host choose to apply standard address generation schemes that
   require the flag to be set.  It is free to assign any address formed
   from an exclusive prefix to any available interface; it is not
   required to configure the address on the link over which the PIO-X RA
   was received (i.e. it is under no obligation to form addresses such
   that they would be classified as on-link (according to the definition
   in [15] section 4, item 1).

5.3.  Sender requirements

   When a router transmits an RA containing one or more PIO-X options it
   SHOULD unicast the PIO-X RA to its intended recipient at the IPv6
   layer and, if applicable, at the link-layer.

   It is RECOMMENDED that a PIO with the X-flag set also have the PIO
   flags L=0 and A=1 explicitly configured, for backward compatibility
   (i.e. use by non X-flag aware nodes).



Kline & Abrahamsson    Expires September 28, 2017               [Page 8]

Internet-Draft         IPv6 RA PIO eXclusive Flag             March 2017


   A router transmitting a PIO-X RA MUST NOT configure for itself any
   address from with the PIO-X prefix.  (If it did, the prefix would
   logically no longer be of exclusive use for the receiving node.)

5.4.  Comparison with DHCPv6 PD

   There exists a key difference in semantics between PIO-X and DHCPv6
   PD: with PIO-X the network keeps the client refreshed with its prefix
   whereas with DHCPv6 PD the client is responsible for refreshing its
   prefix from the server.  This is one reason it is important for the
   data link layer to be able to quickly inform routers of client
   detachment.

   Another difference is that [16] section 12.1 states:

                                          ... the requesting router MUST
      NOT assign any delegated prefixes or subnets from the delegated
      prefix(es) to the link through which it received the DHCP message
      from the delegating router.


   In contrast, a node receiving a PIO-X RA is explicitly free to treat
   the entire prefix as on-link with respect to the interface via which
   it was received.

6.  Host behavior

   TODO: This section needs some work.

6.1.  PIO-X processing

   A receiving node compliant with this document processes an RA with a
   PIO entry with the X flag set according the requirements in previous
   standards documents (chiefly [17] section 6.3.4) subject to the
   additional requirements documented in Section 5.2.

6.2.  Neighbor Discovery implications

6.2.1.  Duplicate Address Detection (DAD)












Kline & Abrahamsson    Expires September 28, 2017               [Page 9]

Internet-Draft         IPv6 RA PIO eXclusive Flag             March 2017


   Whatever use the host makes of the exclusive prefix during its valid
   lifetime, it SHOULD NOT perform Duplicate Address Detection ("DAD",
   [18] section 5.4) on any address it configures from within the prefix
   if that address is configured on either the interface over which the
   PIO-X RA was received or on a loopback interface.  Note that this
   does not absolve the host from performing DAD in all scenarios; if,
   for example, the host uses the prefix for 64sharing [19] it MUST at a
   minimum defend via DAD any addresses it has configured for itself as
   documented in Requirement 2 of [20] section 3.

6.2.2.  Router Solicitations (RSes)

   Routers announcing PIO-X RAs do so via IPv6 unicast to the intended
   receiving node and may note the IPv6 unicast destination address of
   an RS as the next hop for the exclusive prefix.  As such, hosts
   compliant with this SHOULD NOT use the unspecified address (::) when
   sending RSes; they SHOULD prefer issuing Router Solicitations from a
   link-local address.

   It is possible for a node to receive multiple RAs with a mix of
   exclusive and non-exclusive PIOs and even non-zero and zero default
   router lifetimes.  While it is not possible for a host (receiving
   node) to be sure it has received all the RA information available to
   it, hosts compliant with this specification SHOULD implement Packet-
   Loss Resiliency for Router Solicitations [RFC7559] so that the host
   continues to transmit Router Solicitations at least until an RA with
   a non-zero default router lifetime has been seen.

6.3.  Link-local address behavior

   Routers announcing PIO-X RAs may record the source (link-local)
   address of an RS as the next hop for the exclusive prefix.  A node
   compliant with this specification MUST continue to respond to
   Neighbor Solicitations for the source address used to send RSes
   (alternatively: the destination address of unicast PIO-X RAs
   received).  Hosts that deprecate or even remove this address may
   experience a loss of connectivity.

6.4.  Source address selection

   No change to existing source address selection behavior is required
   or specified by this document.









Kline & Abrahamsson    Expires September 28, 2017              [Page 10]

Internet-Draft         IPv6 RA PIO eXclusive Flag             March 2017


6.5.  Next hop router selection

   No change to existing next hop router selection behavior is required
   or specified by this document.

6.6.  Implications for Detecting Network Attachment

   TODO: Describe implications for Detecting Network Attachment in IPv6
   [21] (DNAv6).  Probably the best that can be done is (a) no change to
   RFC6059 coupled with (b) a host MAY send a test packet (e.g. ICMPv6
   Echo Request) with a source and destination address from within the
   PIO-X prefix to the PIO-X RA issuing router and verify the packet is
   delivered back to itself.  Consistent failure to receive such traffic
   MAY be considered a signal that the exclusive prefix should no longer
   be used by the host.

6.7.  Additional guidance

   The intent of networks that use PIO-X RAs is not to enable
   sophisticated routing architectures that could be far better handled
   by an actual routing protocol but rather to propagate a prefix's
   exclusive use information to enable the receiving node to make better
   use of the available addresses.  As such:

      A PIO-X receiving node SHOULD NOT issue ICMPv6 Redirects
      ([RFC4861] section 4.5) for any address within an exclusive use
      prefix via the link over which the PIO-X RA was received.
      Redirecting portions of exclusive prefixes to other "upstream" on-
      link nodes is not a supported configuration.

      A PIO-X receiving node SHOULD NOT transmit RAs with any subset of
      its exclusive prefixes via the same interface through which the
      exclusive prefix was learned.

7.  Router behavior

   TODO: This section needs some work.

7.1.  PIO-X RA destination address

   Since the host will not perform DAD for addresses within prefix
   announced via PIO-X, it's very important that only a single host
   receives the PIO-X RA.  Therefore, the router MUST only include PIO-X
   in RAs that are sent using unicast RAs to destination unicast link-
   layer address and IPv6 link-local unicast address for a specific
   host.  For point-to-point media without link-layer addresses or where
   there is guaranteed to only be single host that will receive the
   PIO-X RA (e.g. as enforced by link layer mechanisms), the router MAY



Kline & Abrahamsson    Expires September 28, 2017              [Page 11]

Internet-Draft         IPv6 RA PIO eXclusive Flag             March 2017


   send PIO-X RA with multicast destination IPv6 address.  Under all
   circumstances the router MUST maintain a binding table of state
   information as discussed in Section 7.3.

7.2.  Detecting hosts to send PIO-X RAs to

   When the host starts using a network connection it normally sends out
   an RS (Router Solicitation) packet.  This is one way for the router
   to detect that a new host is connected to the network and detects its
   link-local address.  If the router is configured to use PIO-X, it can
   now perform necessary processing/configuration and then send the
   PIO-X RA.

   For some networks, the host information regarding link-layer and
   link-local address might be available through other mechanism(s).
   Examples of this are PPP, 802.1x and 3GPP mobile networks.  In that
   case this information MAY be used instead of relying on the host to
   send RS.  It is however RECOMMENDED that these networks also provide
   indication whether the host is no longer connected to the network so
   that the router can invalidate the prefix binding prior to binding
   expiration (timeout).

7.3.  Binding table requirements

   Routers transmitting PIO-X RAs have state maintenance and operational
   requirements similar to delegating routers in networks where DHCPv6
   Prefix Delegation [RFC3633] is used.  The state maintained is
   describe here in terms of a conceptual binding table.

   R1  The router SHOULD keep track of which PIO-X prefix has been
       issued to each node.

   R2  The router SHOULD keep the binding between prefix and link-local
       address for the advertised valid lifetime, plus some
       operationally determined delay prior to reissuing a prefix
       ("grace period"), of the prefix.

   R3  The router MUST monitor the reachability of each node in the
       binding table via Neighbor Unreachability Detection ("NUD", [22]
       section 7.3) or an equivalent link-layer mechanism.

   R4  The binding SHOULD be considered refreshed every time a periodic
       PIO-X RA is sent to a node.








Kline & Abrahamsson    Expires September 28, 2017              [Page 12]

Internet-Draft         IPv6 RA PIO eXclusive Flag             March 2017


   R5  If the router is informed by some other mechanism (link-layer
       indication for instance) that a node is no longer connected to
       the link, it MAY immediately invalidate the prefix binding.
       (DISCUSS: Is this the correct approach?  Do we want to point to
       some definition somewhere else?)

7.4.  Preparations before sending a PIO-X RA

   When the router intends to send a PIO-X RA, it SHOULD before sending
   the PIO-X RA, complete any and all necessary processing for the host
   to start using the PIO-X prefix to communicate through the router to
   other networks.  This is so that the host can start using PIO-X based
   addresses without delay or error after receipt of the PIO-X RA.

7.5.  Implementation considerations

   TODO: Out of scope things that are worth careful consideration
   include...

   Routers SHOULD NOT announce the same prefix to two different nodes
   within the valid lifetime of the earlier of the two PIO-X
   announcements.

   A link may operate in a mode where routers announce RAs to all nodes,
   possibly with non-exclusive PIO data, and non-zero default router
   lifetimes.  Separately, one or more other nodes on the link may
   announce exclusive PIO information to nodes along with zero default
   router lifetimes.  Except in the presence of a non-expired more
   specific route, e.g. learning from an [23] Route Information Option
   (RIO), the receiving node should send exclusive use prefix originated
   or forwarded traffic destined off-link through routers with non-zero
   default router lifetimes.

8.  Acknowledgements

9.  IANA Considerations

   This memo contains no requests of IANA.

10.  Security Considerations

   This document fundamentally introduces no new protocol or behavior
   substantively different from existing behavior on a link which
   guarantees a unique /64 prefix to every attached host.  It only
   describes a mechanism to convey that topological reality, allowing
   the host to make certain optimizations as well as share the exclusive
   prefix as it sees fit with other nodes according to its capabilities
   and policies.



Kline & Abrahamsson    Expires September 28, 2017              [Page 13]

Internet-Draft         IPv6 RA PIO eXclusive Flag             March 2017


11.  References

11.1.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.

   [RFC4861]  Narten, T., Nordmark, E., Simpson, W., and H. Soliman,
              "Neighbor Discovery for IP version 6 (IPv6)", RFC 4861,
              DOI 10.17487/RFC4861, September 2007,
              <http://www.rfc-editor.org/info/rfc4861>.

   [RFC4862]  Thomson, S., Narten, T., and T. Jinmei, "IPv6 Stateless
              Address Autoconfiguration", RFC 4862, DOI 10.17487/
              RFC4862, September 2007,
              <http://www.rfc-editor.org/info/rfc4862>.

   [RFC6275]  Perkins, C., Ed., Johnson, D., and J. Arkko, "Mobility
              Support in IPv6", RFC 6275, DOI 10.17487/RFC6275, July
              2011, <http://www.rfc-editor.org/info/rfc6275>.

   [RFC7559]  Krishnan, S., Anipko, D., and D. Thaler, "Packet-Loss
              Resiliency for Router Solicitations", RFC 7559, DOI
              10.17487/RFC7559, May 2015,
              <http://www.rfc-editor.org/info/rfc7559>.

11.2.  Informative References

   [RFC3633]  Troan, O. and R. Droms, "IPv6 Prefix Options for Dynamic
              Host Configuration Protocol (DHCP) version 6", RFC 3633,
              DOI 10.17487/RFC3633, December 2003,
              <http://www.rfc-editor.org/info/rfc3633>.

   [RFC4191]  Draves, R. and D. Thaler, "Default Router Preferences and
              More-Specific Routes", RFC 4191, DOI 10.17487/RFC4191,
              November 2005, <http://www.rfc-editor.org/info/rfc4191>.

   [RFC4429]  Moore, N., "Optimistic Duplicate Address Detection (DAD)
              for IPv6", RFC 4429, DOI 10.17487/RFC4429, April 2006,
              <http://www.rfc-editor.org/info/rfc4429>.

   [RFC5452]  Hubert, A. and R. van Mook, "Measures for Making DNS More
              Resilient against Forged Answers", RFC 5452, DOI 10.17487/
              RFC5452, January 2009,
              <http://www.rfc-editor.org/info/rfc5452>.

   [RFC7066]  Korhonen, J., Ed., Arkko, J., Ed., Savolainen, T., and S.
              Krishnan, "IPv6 for Third Generation Partnership Project



Kline & Abrahamsson    Expires September 28, 2017              [Page 14]

Internet-Draft         IPv6 RA PIO eXclusive Flag             March 2017


              (3GPP) Cellular Hosts", RFC 7066, DOI 10.17487/RFC7066,
              November 2013, <http://www.rfc-editor.org/info/rfc7066>.

   [RFC7934]  Colitti, L., Cerf, V., Cheshire, S., and D. Schinazi,
              "Host Address Availability Recommendations", BCP 204, RFC
              7934, DOI 10.17487/RFC7934, July 2016,
              <http://www.rfc-editor.org/info/rfc7934>.

Authors' Addresses

   Erik Kline
   Google Japan KK
   6-10-1 Roppongi
   Mori Tower, 44th floor
   Minato, Tokyo  106-6126
   JP

   Email: ek@google.com


   Mikael Abrahamsson
   T-Systems Nordic
   Kistagangen 26
   Stockholm
   SE

   Email: Mikael.Abrahamsson@t-systems.se
























Kline & Abrahamsson    Expires September 28, 2017              [Page 15]
